DataProcessors/КорректировкаСобранныхСборок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>КорректировкаСобранныхСборок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОткорректированныеРегламентомСобранныеСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОткорректированныеРегламентомСобранныеСборки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Напечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КорректировкаСборки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/КорректировкаСобранныхСборок/Ext/ManagerModule.bsl
Процедура ВывестиСообщениеОНаличииКорректировокСборки() Экспорт
	Форма = ПолучитьФорму("ФормаПредупреждения");
	Если НЕ Форма.Открыта() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОткорректированныеРегламентомСобранныеСборки.КорректировкаСборки
		|ИЗ
		|	РегистрСведений.ОткорректированныеРегламентомСобранныеСборки КАК ОткорректированныеРегламентомСобранныеСборки
		|ГДЕ
		|	ОткорректированныеРегламентомСобранныеСборки.Напечатан = ЛОЖЬ";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда		
			Результат = Форма.ОткрытьМодально();
			Если ТипЗнч(Результат) = Тип("Строка") Тогда
				ОбщаяТаблица = Новый ТабличныйДокумент;
				РезультатЗапроса = Запрос.Выполнить();
				Если НЕ РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Пока Выборка.Следующий() Цикл
						ДокОбъект = Выборка.КорректировкаСборки.ПолучитьОбъект();
						ТабДок = ДокОбъект.ПечатьЗаданияНаРазбор();
						ОбщаяТаблица.Вывести(ТабДок);
						ОбщаяТаблица.ВывестиГоризонтальныйРазделительСтраниц();
						МЗ = РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки.СоздатьМенеджерЗаписи();
						МЗ.КорректировкаСборки = ДокОбъект.Ссылка;
						МЗ.Напечатан = Истина;
						МЗ.ДатаЗаписи = ТекущаяДата();
						МЗ.Записать();
					КонецЦикла;
					ОбщаяТаблица.ФиксацияСверху = 2;
					ОбщаяТаблица.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
					ОбщаяТаблица.АвтоМасштаб = Истина;
					ОбщаяТаблица.ОтображатьЗаголовки = Ложь;
					ОбщаяТаблица.ОтображатьСетку = Ложь;
					ОбщаяТаблица.ТолькоПросмотр = Истина;
					Если Результат = "" Тогда
						ОбщаяТаблица.Показать();	
					Иначе
						ОбщаяТаблица.ИмяПринтера = Результат;
						ОбщаяТаблица.Напечатать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
